src/ex_Tabakon/Documents/ТБК_ЗаявкаОтМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ТБК_ЗаявкаОтМагазина</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТБК_ВидыОперацийЗаявокОтМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗаявкиНаПоступление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТБК_ВидыПричинЗаявокНаПоступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакОбновление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБКПроекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаЗабрали</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСборкиФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флСозданВУТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПакетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСформирован</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаБрака</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТБКПричиныБрака</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаркиНаПроверку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хорошая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НашаОрганизация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБК_ЗаявкаОтМагазина/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураСодержитПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьПоиск", ПоискПоНоменклатруре);
	Список.Параметры.УстановитьЗначениеПараметра("КлючевоеСлово", "%" + НоменклатураСодержит + "%");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.ПризнакОбновление = 0 тогда
			УбратьПризнакСервер(ТекСтрока.Номер, ТекСтрока.Дата);
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСерверебезКонтекста
Процедура УбратьПризнакСервер(Номер,Дата)
	Об	=	Документы.ТБК_ЗаявкаОтМагазина.НайтиПоНомеру(Номер,дата).ПолучитьОбъект();
	Об.ПризнакОбновление	=	1;
	Об.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура Инструкция(Команда)
	ОбщегоНазначенияВызовСервера.ОткрытьНужнуюИнструкцию("Заявка на возврат товара");		
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Статус",,ВидСравненияКомпоновкиДанных.Содержит,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ФильтрПоПроектам.Очистить();
	
	если ПоказыватьВсе тогда Возврат; КонецЕсли;
		
	Если ПоказатьТолькоИМ тогда 
		
		ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());   	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	иначе
		//Марк 2025-01-10
		ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());   	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.НеВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//КонецМарк
		Если НачалоДня(ТекущаяДата()) <= '20250104'  Тогда //Марк 2024-12-16
			
			ФильтрПоПроектам.Добавить(ПолучитьПроектЧистка());   	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.НеВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ЭтоИМ") тогда
		Если Параметры.ЭтоИМ тогда
			ПоказатьТолькоИМ	=	Истина;		
		иначе
			ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());	
		КонецЕсли;
	//Марк 2025-02-03	
	ИначеЕсли Параметры.Свойство("ПоказыватьВсе") Тогда
		ПоказыватьВсе = Истина;
	//КонецМарк 
	КонецЕсли;
		
	ФильтрПроектСписано = Справочники.ТБКПроекты.НайтиПоНаименованию("Списано");
	
	//Марк 2026-03-03 https://jira.tabkn.ru/browse/ROZ-22
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьПоиск", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("КлючевоеСлово", "");
	//КонецМарк
	
КонецПроцедуры

&НаСерверебезКонтекста 
Функция ПолучитьПроектЧистка()
	Возврат Справочники.ТБКПроекты.НайтиПоНаименованию("ЧИСТКА");	
КонецФункции


&НаСерверебезКонтекста
Функция ПолучтьПроектИнтернетМагазин() //Марк 2024-02-27
	Возврат Справочники.ТБКПроекты.НайтиПоНаименованию("Возврат (Собирать) интернет-магазин");
КонецФункции

&НаКлиенте
Процедура ОтчетТБКЗаявки(Команда)
	ОткрытьФорму("Отчет.ТБКОтчет_ТБК_Заявки.Форма");
КонецПроцедуры
